### Plan for production
🟡 Modify module.event_sourcing.aws_kinesis_firehose_delivery_stream.firehose_direct_delivery_stream["AbTestChangeEvent"]
🟡 Modify module.event_sourcing.aws_kinesis_firehose_delivery_stream.firehose_direct_delivery_stream["AbTestParticipantAllocationEvent"]
🟡 Modify module.event_sourcing.module.table["AbTestChangeEvent"].snowflake_table.this
🟡 Modify module.event_sourcing.module.table["AbTestParticipantAllocationEvent"].snowflake_table.this
🟠 Replace module.event_sourcing.aws_cloudwatch_log_group.firehose_direct_log_group["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.aws_cloudwatch_log_group.firehose_direct_log_group["AbTestParticipantAllocationEvent"]
🟠 Replace module.event_sourcing.aws_cloudwatch_log_stream.firehose_direct_log_stream["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.aws_cloudwatch_log_stream.firehose_direct_log_stream["AbTestParticipantAllocationEvent"]
🟠 Replace module.event_sourcing.aws_iam_policy.firehose_outgoing_permissions_policy["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.aws_iam_policy.firehose_outgoing_permissions_policy["AbTestParticipantAllocationEvent"]
🟠 Replace module.event_sourcing.aws_iam_policy.service_additional_permissions
🟠 Replace module.event_sourcing.aws_iam_role_policy_attachment.firehose_outgoing_role_policy_attachment["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.aws_iam_role_policy_attachment.firehose_outgoing_role_policy_attachment["AbTestParticipantAllocationEvent"]
🟠 Replace module.event_sourcing.aws_iam_role_policy_attachment.service_additional_permissions
🟠 Replace module.event_sourcing.aws_s3_bucket_notification.bucket_notifications
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"]
🟠 Replace module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition
🟠 Replace module.event_sourcing.module.pipe["AbTestChangeEvent"].snowflake_pipe.this
🟠 Replace module.event_sourcing.module.pipe["AbTestParticipantAllocationEvent"].snowflake_pipe.this
🟠 Replace module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket.bucket
🟠 Replace module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_lifecycle_configuration.lifecycle_configuration[0]
🟠 Replace module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_ownership_controls.ownership[0]
🟠 Replace module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_server_side_encryption_configuration.server_side_encryption
🟠 Replace module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_versioning.versioning[0]
🟠 Replace module.event_sourcing.module.stage.snowflake_stage.this

**0 to add, 4 to modify, 22 to replace, 0 to delete**

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # module.event_sourcing.data.aws_iam_policy_document.firehose_outgoing_permissions["AbTestChangeEvent"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "firehose_outgoing_permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "glue:GetTableVersions",
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:GetTableVersions",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:GetFunctionConfiguration",
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:eu-west-1:090999133015:function:event-deserialise:$LATEST",
            ]
        }
    }

  # module.event_sourcing.data.aws_iam_policy_document.firehose_outgoing_permissions["AbTestParticipantAllocationEvent"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "firehose_outgoing_permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "glue:GetTableVersions",
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:GetTableVersions",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:GetFunctionConfiguration",
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:eu-west-1:090999133015:function:event-deserialise:$LATEST",
            ]
        }
    }

  # module.event_sourcing.data.aws_iam_policy_document.service_additional_permissions_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "service_additional_permissions_document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "glue:GetTableVersions",
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:GetSchemaByDefinition",
              + "glue:GetTableVersions",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "firehose:DeleteDeliveryStream",
              + "firehose:PutRecord",
              + "firehose:PutRecordBatch",
              + "firehose:UpdateDestination",
            ]
          + resources = [
              + "arn:aws:firehose:eu-west-1:090999133015:deliverystream/event-abtestchangeevent-direct",
            ]
        }
      + statement {
          + actions   = [
              + "firehose:DeleteDeliveryStream",
              + "firehose:PutRecord",
              + "firehose:PutRecordBatch",
              + "firehose:UpdateDestination",
            ]
          + resources = [
              + "arn:aws:firehose:eu-west-1:090999133015:deliverystream/event-abtestparticipantallocationevent-direct",
            ]
        }
    }

  # module.event_sourcing.aws_cloudwatch_log_group.firehose_direct_log_group["AbTestChangeEvent"] must be replaced
-/+ resource "aws_cloudwatch_log_group" "firehose_direct_log_group" {
      ~ arn               = "arn:aws:logs:eu-west-1:090999133015:log-group:ab-testing-abtestchangeevent-firehose-direct-logs" -> (known after apply)
      ~ id                = "ab-testing-abtestchangeevent-firehose-direct-logs" -> (known after apply)
      ~ name              = "ab-testing-abtestchangeevent-firehose-direct-logs" -> "uk-multi-ab-testing-abtestchangeevent-firehose-direct-logs" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.event_sourcing.aws_cloudwatch_log_group.firehose_direct_log_group["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "aws_cloudwatch_log_group" "firehose_direct_log_group" {
      ~ arn               = "arn:aws:logs:eu-west-1:090999133015:log-group:ab-testing-abtestparticipantallocationevent-firehose-direct-logs" -> (known after apply)
      ~ id                = "ab-testing-abtestparticipantallocationevent-firehose-direct-logs" -> (known after apply)
      ~ name              = "ab-testing-abtestparticipantallocationevent-firehose-direct-logs" -> "uk-multi-ab-testing-abtestparticipantallocationevent-firehose-direct-logs" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.event_sourcing.aws_cloudwatch_log_stream.firehose_direct_log_stream["AbTestChangeEvent"] must be replaced
-/+ resource "aws_cloudwatch_log_stream" "firehose_direct_log_stream" {
      ~ arn            = "arn:aws:logs:eu-west-1:090999133015:log-group:ab-testing-abtestchangeevent-firehose-direct-logs:log-stream:ab-testing-abtestchangeevent-firehose-direct-log-stream" -> (known after apply)
      ~ id             = "ab-testing-abtestchangeevent-firehose-direct-log-stream" -> (known after apply)
      ~ log_group_name = "ab-testing-abtestchangeevent-firehose-direct-logs" -> "uk-multi-ab-testing-abtestchangeevent-firehose-direct-logs" # forces replacement
      ~ name           = "ab-testing-abtestchangeevent-firehose-direct-log-stream" -> "uk-multi-ab-testing-abtestchangeevent-firehose-direct-log-stream" # forces replacement
    }

  # module.event_sourcing.aws_cloudwatch_log_stream.firehose_direct_log_stream["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "aws_cloudwatch_log_stream" "firehose_direct_log_stream" {
      ~ arn            = "arn:aws:logs:eu-west-1:090999133015:log-group:ab-testing-abtestparticipantallocationevent-firehose-direct-logs:log-stream:ab-testing-abtestparticipantallocationevent-firehose-direct-log-stream" -> (known after apply)
      ~ id             = "ab-testing-abtestparticipantallocationevent-firehose-direct-log-stream" -> (known after apply)
      ~ log_group_name = "ab-testing-abtestparticipantallocationevent-firehose-direct-logs" -> "uk-multi-ab-testing-abtestparticipantallocationevent-firehose-direct-logs" # forces replacement
      ~ name           = "ab-testing-abtestparticipantallocationevent-firehose-direct-log-stream" -> "uk-multi-ab-testing-abtestparticipantallocationevent-firehose-direct-log-stream" # forces replacement
    }

  # module.event_sourcing.aws_iam_policy.firehose_outgoing_permissions_policy["AbTestChangeEvent"] must be replaced
-/+ resource "aws_iam_policy" "firehose_outgoing_permissions_policy" {
      ~ arn         = "arn:aws:iam::090999133015:policy/ab-testing-abtestchangeevent-firehose-outgoing-permissions-policy" -> (known after apply)
      ~ id          = "arn:aws:iam::090999133015:policy/ab-testing-abtestchangeevent-firehose-outgoing-permissions-policy" -> (known after apply)
      ~ name        = "ab-testing-abtestchangeevent-firehose-outgoing-permissions-policy" -> "uk-multi-ab-testing-abtestchangeevent-firehose-outgoing-permissions-policy" # forces replacement
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:AbortMultipartUpload",
                          - "glue:GetTableVersions",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::marshmallow-event-sourcing-ab-testing/*",
                          - "arn:aws:s3:::marshmallow-event-sourcing-ab-testing",
                        ]
                    },
                  - {
                      - Action   = "logs:PutLogEvents"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:eu-west-1:090999133015:log-group:ab-testing-abtestchangeevent-firehose-direct-logs:log-stream:ab-testing-abtestchangeevent-firehose-direct-log-stream"
                    },
                  - {
                      - Action   = "glue:GetTableVersions"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "lambda:GetFunctionConfiguration",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:eu-west-1:090999133015:function:event-deserialise:$LATEST"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id   = "ANPARKL7YSNLYIR5RDU2O" -> (known after apply)
      - tags        = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.event_sourcing.aws_iam_policy.firehose_outgoing_permissions_policy["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "aws_iam_policy" "firehose_outgoing_permissions_policy" {
      ~ arn         = "arn:aws:iam::090999133015:policy/ab-testing-abtestparticipantallocationevent-firehose-outgoing-permissions-policy" -> (known after apply)
      ~ id          = "arn:aws:iam::090999133015:policy/ab-testing-abtestparticipantallocationevent-firehose-outgoing-permissions-policy" -> (known after apply)
      ~ name        = "ab-testing-abtestparticipantallocationevent-firehose-outgoing-permissions-policy" -> "uk-multi-ab-testing-abtestparticipantallocationevent-firehose-outgoing-permissions-policy" # forces replacement
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:AbortMultipartUpload",
                          - "glue:GetTableVersions",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::marshmallow-event-sourcing-ab-testing/*",
                          - "arn:aws:s3:::marshmallow-event-sourcing-ab-testing",
                        ]
                    },
                  - {
                      - Action   = "logs:PutLogEvents"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:eu-west-1:090999133015:log-group:ab-testing-abtestparticipantallocationevent-firehose-direct-logs:log-stream:ab-testing-abtestparticipantallocationevent-firehose-direct-log-stream"
                    },
                  - {
                      - Action   = "glue:GetTableVersions"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "lambda:GetFunctionConfiguration",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:eu-west-1:090999133015:function:event-deserialise:$LATEST"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id   = "ANPARKL7YSNLVJH6YHPZV" -> (known after apply)
      - tags        = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.event_sourcing.aws_iam_policy.service_additional_permissions must be replaced
-/+ resource "aws_iam_policy" "service_additional_permissions" {
      ~ arn         = "arn:aws:iam::090999133015:policy/ab-testing-anayltics-permissions-policy" -> (known after apply)
      ~ id          = "arn:aws:iam::090999133015:policy/ab-testing-anayltics-permissions-policy" -> (known after apply)
      ~ name        = "ab-testing-anayltics-permissions-policy" -> "uk-multi-ab-testing-anayltics-permissions-policy" # forces replacement
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:AbortMultipartUpload",
                          - "glue:GetTableVersions",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::marshmallow-event-sourcing-ab-testing/*",
                          - "arn:aws:s3:::marshmallow-event-sourcing-ab-testing",
                        ]
                    },
                  - {
                      - Action   = [
                          - "glue:GetTableVersions",
                          - "glue:GetSchemaByDefinition",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "firehose:UpdateDestination",
                          - "firehose:PutRecordBatch",
                          - "firehose:PutRecord",
                          - "firehose:DeleteDeliveryStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:firehose:eu-west-1:090999133015:deliverystream/event-abtestchangeevent-direct"
                    },
                  - {
                      - Action   = [
                          - "firehose:UpdateDestination",
                          - "firehose:PutRecordBatch",
                          - "firehose:PutRecord",
                          - "firehose:DeleteDeliveryStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:firehose:eu-west-1:090999133015:deliverystream/event-abtestparticipantallocationevent-direct"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id   = "ANPARKL7YSNL47KR3FFLR" -> (known after apply)
      - tags        = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.event_sourcing.aws_iam_role_policy_attachment.firehose_outgoing_role_policy_attachment["AbTestChangeEvent"] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "firehose_outgoing_role_policy_attachment" {
      ~ id         = "abtestchangeevent-out-role-20231108104109451700000002" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::090999133015:policy/ab-testing-abtestchangeevent-firehose-outgoing-permissions-policy" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.event_sourcing.aws_iam_role_policy_attachment.firehose_outgoing_role_policy_attachment["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "firehose_outgoing_role_policy_attachment" {
      ~ id         = "abtestparticipantallocationevent-out-role-20231108104109221600000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::090999133015:policy/ab-testing-abtestparticipantallocationevent-firehose-outgoing-permissions-policy" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.event_sourcing.aws_iam_role_policy_attachment.service_additional_permissions must be replaced
-/+ resource "aws_iam_role_policy_attachment" "service_additional_permissions" {
      ~ id         = "ab-testing-task-role-20231108104231832500000003" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::090999133015:policy/ab-testing-anayltics-permissions-policy" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.event_sourcing.aws_kinesis_firehose_delivery_stream.firehose_direct_delivery_stream["AbTestChangeEvent"] will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose_direct_delivery_stream" {
        id             = "arn:aws:firehose:eu-west-1:090999133015:deliverystream/event-abtestchangeevent-direct"
        name           = "event-abtestchangeevent-direct"
        tags           = {}
        # (5 unchanged attributes hidden)

      ~ extended_s3_configuration {
          ~ bucket_arn          = "arn:aws:s3:::marshmallow-event-sourcing-ab-testing" -> (known after apply)
            # (7 unchanged attributes hidden)

          ~ cloudwatch_logging_options {
              ~ log_group_name  = "ab-testing-abtestchangeevent-firehose-direct-logs" -> "uk-multi-ab-testing-abtestchangeevent-firehose-direct-logs"
              ~ log_stream_name = "ab-testing-abtestchangeevent-firehose-direct-log-stream" -> "uk-multi-ab-testing-abtestchangeevent-firehose-direct-log-stream"
                # (1 unchanged attribute hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.event_sourcing.aws_kinesis_firehose_delivery_stream.firehose_direct_delivery_stream["AbTestParticipantAllocationEvent"] will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose_direct_delivery_stream" {
        id             = "arn:aws:firehose:eu-west-1:090999133015:deliverystream/event-abtestparticipantallocationevent-direct"
        name           = "event-abtestparticipantallocationevent-direct"
        tags           = {}
        # (5 unchanged attributes hidden)

      ~ extended_s3_configuration {
          ~ bucket_arn          = "arn:aws:s3:::marshmallow-event-sourcing-ab-testing" -> (known after apply)
            # (7 unchanged attributes hidden)

          ~ cloudwatch_logging_options {
              ~ log_group_name  = "ab-testing-abtestparticipantallocationevent-firehose-direct-logs" -> "uk-multi-ab-testing-abtestparticipantallocationevent-firehose-direct-logs"
              ~ log_stream_name = "ab-testing-abtestparticipantallocationevent-firehose-direct-log-stream" -> "uk-multi-ab-testing-abtestparticipantallocationevent-firehose-direct-log-stream"
                # (1 unchanged attribute hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.event_sourcing.aws_s3_bucket_notification.bucket_notifications must be replaced
-/+ resource "aws_s3_bucket_notification" "bucket_notifications" {
      ~ bucket      = "marshmallow-event-sourcing-ab-testing" -> "marshmallow-event-sourcing-uk-multi-ab-testing" # forces replacement
      ~ id          = "marshmallow-event-sourcing-ab-testing" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ queue {
            id            = "snowflake_AbTestChangeEvent"
          ~ queue_arn     = "arn:aws:sqs:eu-west-1:546610702380:sf-snowpipe-AIDAX6REJNAWJY3BIWUFW-vRJ-RVQs51Poc3eb7_NGsw" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ queue {
            id            = "snowflake_AbTestParticipantAllocationEvent"
          ~ queue_arn     = "arn:aws:sqs:eu-west-1:546610702380:sf-snowpipe-AIDAX6REJNAWJY3BIWUFW-vRJ-RVQs51Poc3eb7_NGsw" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "3790172057706634679" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-09T09:00:34Z" -> (known after apply)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "2947096489396731623" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-09T09:00:34Z" -> (known after apply)
        }
    }

  # module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:090999133015:task-definition/ab-testing:20" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:090999133015:task-definition/ab-testing" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_TRACE_SAMPLE_RATE"
                            value = "0.5"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "0.0.28-132" -> "0.0.29-134"
                        },
                        {
                            name  = "cloud.aws.credentials.instanceProfile"
                            value = "true"
                        },
                        # (6 unchanged elements hidden)
                    ]
                  ~ image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.28-132" -> "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.29-134"
                  - mountPoints      = []
                    name             = "ab-testing"
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints  = []
                    name         = "datadog-agent"
                  - volumesFrom  = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - environment           = []
                  - mountPoints           = []
                    name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - volumesFrom           = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "envoy"
                  - portMappings     = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ab-testing" -> (known after apply)
      ~ revision                 = 20 -> (known after apply)
      ~ tags                     = {
            "service" = "ab-testing"
          ~ "version" = "0.0.28-132" -> "0.0.29-134"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.28-132" -> "0.0.29-134"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.event_sourcing.module.pipe["AbTestChangeEvent"].snowflake_pipe.this must be replaced
-/+ resource "snowflake_pipe" "this" {
      ~ copy_statement       = "copy into RAW.AUTOMOTIVE.AB_TESTING_ABTESTCHANGEEVENT from @RAW.AUTOMOTIVE.EVENT_SOURCING_AB_TESTING/firehose_consumer_success/AbTestChangeEvent/" -> "copy into RAW.AUTOMOTIVE.UK_MULTI_AB_TESTING_ABTESTCHANGEEVENT from @RAW.AUTOMOTIVE.EVENT_SOURCING_UK_MULTI_AB_TESTING/firehose_consumer_success/AbTestChangeEvent/" # forces replacement
      ~ id                   = "RAW|AUTOMOTIVE|ABTESTCHANGEEVENT" -> (known after apply)
        name                 = "ABTESTCHANGEEVENT"
      ~ notification_channel = "arn:aws:sqs:eu-west-1:546610702380:sf-snowpipe-AIDAX6REJNAWJY3BIWUFW-vRJ-RVQs51Poc3eb7_NGsw" -> (known after apply)
      ~ owner                = "TERRAFORM" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.event_sourcing.module.pipe["AbTestParticipantAllocationEvent"].snowflake_pipe.this must be replaced
-/+ resource "snowflake_pipe" "this" {
      ~ copy_statement       = "copy into RAW.AUTOMOTIVE.AB_TESTING_ABTESTPARTICIPANTALLOCATIONEVENT from @RAW.AUTOMOTIVE.EVENT_SOURCING_AB_TESTING/firehose_consumer_success/AbTestParticipantAllocationEvent/" -> "copy into RAW.AUTOMOTIVE.UK_MULTI_AB_TESTING_ABTESTPARTICIPANTALLOCATIONEVENT from @RAW.AUTOMOTIVE.EVENT_SOURCING_UK_MULTI_AB_TESTING/firehose_consumer_success/AbTestParticipantAllocationEvent/" # forces replacement
      ~ id                   = "RAW|AUTOMOTIVE|ABTESTPARTICIPANTALLOCATIONEVENT" -> (known after apply)
        name                 = "ABTESTPARTICIPANTALLOCATIONEVENT"
      ~ notification_channel = "arn:aws:sqs:eu-west-1:546610702380:sf-snowpipe-AIDAX6REJNAWJY3BIWUFW-vRJ-RVQs51Poc3eb7_NGsw" -> (known after apply)
      ~ owner                = "TERRAFORM" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + jsonencode({}),
          + (known after apply),
          + (known after apply),
        ]
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.data.aws_iam_policy_document.enforce_tls_v12_or_higher will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "enforce_tls_v12_or_higher" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "enforce-tls-v12-or-higher"

          + condition {
              + test     = "NumericLessThan"
              + values   = [
                  + "1.2",
                ]
              + variable = "s3:TlsVersion"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket.bucket must be replaced
-/+ resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::marshmallow-event-sourcing-ab-testing" -> (known after apply)
      ~ bucket                      = "marshmallow-event-sourcing-ab-testing" -> "marshmallow-event-sourcing-uk-multi-ab-testing" # forces replacement
      ~ bucket_domain_name          = "marshmallow-event-sourcing-ab-testing.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "marshmallow-event-sourcing-ab-testing.s3.eu-west-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z1BKCTXD74EZPE" -> (known after apply)
      ~ id                          = "marshmallow-event-sourcing-ab-testing" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "eu-west-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          ~ "Name" = "marshmallow-event-sourcing-ab-testing" -> "marshmallow-event-sourcing-uk-multi-ab-testing"
        }
      ~ tags_all                    = {
          ~ "Name"           = "marshmallow-event-sourcing-ab-testing" -> "marshmallow-event-sourcing-uk-multi-ab-testing"
            # (5 unchanged elements hidden)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "ba5e7b0d24a238c2412ef4811c07e89702883a3e50a76c6862db3cb45a2be967" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "standard_infrequent_access_archive" -> null
          - tags                                   = {} -> null

          - transition {
              - days          = 30 -> null
              - storage_class = "STANDARD_IA" -> null
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_lifecycle_configuration.lifecycle_configuration[0] must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "lifecycle_configuration" {
      ~ bucket = "marshmallow-event-sourcing-ab-testing" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "marshmallow-event-sourcing-ab-testing" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_ownership_controls.ownership[0] must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "ownership" {
      ~ bucket = "marshmallow-event-sourcing-ab-testing" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "marshmallow-event-sourcing-ab-testing" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_server_side_encryption_configuration.server_side_encryption must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "server_side_encryption" {
      ~ bucket = "marshmallow-event-sourcing-ab-testing" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "marshmallow-event-sourcing-ab-testing" -> (known after apply)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_versioning.versioning[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "versioning" {
      ~ bucket = "marshmallow-event-sourcing-ab-testing" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "marshmallow-event-sourcing-ab-testing" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.event_sourcing.module.stage.snowflake_stage.this must be replaced
-/+ resource "snowflake_stage" "this" {
      ~ aws_external_id     = "XS67435_SFCRole=8_7GSABIIDa4geh5f7zrv0cyk5tU0=" -> (known after apply)
      ~ id                  = "RAW|AUTOMOTIVE|EVENT_SOURCING_AB_TESTING" -> (known after apply)
      ~ name                = "EVENT_SOURCING_AB_TESTING" -> "EVENT_SOURCING_UK_MULTI_AB_TESTING" # forces replacement
      ~ snowflake_iam_user  = "arn:aws:iam::546610702380:user/xc2w-s-iest6242" -> (known after apply)
      ~ url                 = "s3://marshmallow-event-sourcing-ab-testing/" -> "s3://marshmallow-event-sourcing-uk-multi-ab-testing/"
        # (5 unchanged attributes hidden)
    }

  # module.event_sourcing.module.table["AbTestChangeEvent"].snowflake_table.this will be updated in-place
  ~ resource "snowflake_table" "this" {
        id                  = "RAW|AUTOMOTIVE|AB_TESTING_ABTESTCHANGEEVENT"
      ~ name                = "AB_TESTING_ABTESTCHANGEEVENT" -> "UK_MULTI_AB_TESTING_ABTESTCHANGEEVENT"
        # (7 unchanged attributes hidden)

      ~ column {
          ~ name     = "EVENT_TIME" -> "PARTICIPANT_ID"
            # (2 unchanged attributes hidden)
        }
      ~ column {
          ~ name     = "EVENT_DATA" -> "RESOURCE_VERSION"
          ~ type     = "VARIANT" -> "NUMBER(38,0)"
            # (1 unchanged attribute hidden)
        }
      ~ column {
          ~ name     = "PARTICIPANT_ID" -> "EVENT_TIME"
            # (2 unchanged attributes hidden)
        }
      ~ column {
          ~ name     = "RESOURCE_VERSION" -> "EVENT_DATA"
          ~ type     = "NUMBER(38,0)" -> "VARIANT"
            # (1 unchanged attribute hidden)
        }
    }

  # module.event_sourcing.module.table["AbTestParticipantAllocationEvent"].snowflake_table.this will be updated in-place
  ~ resource "snowflake_table" "this" {
        id                  = "RAW|AUTOMOTIVE|AB_TESTING_ABTESTPARTICIPANTALLOCATIONEVENT"
      ~ name                = "AB_TESTING_ABTESTPARTICIPANTALLOCATIONEVENT" -> "UK_MULTI_AB_TESTING_ABTESTPARTICIPANTALLOCATIONEVENT"
        # (7 unchanged attributes hidden)

      ~ column {
          ~ name     = "EVENT_TIME" -> "RESOURCE_VERSION"
          ~ type     = "VARCHAR(16777216)" -> "NUMBER(38,0)"
            # (1 unchanged attribute hidden)
        }
      ~ column {
          ~ name     = "EVENT_DATA" -> "EVENT_TIME"
          ~ type     = "VARIANT" -> "VARCHAR(16777216)"
            # (1 unchanged attribute hidden)
        }
      ~ column {
          ~ name     = "RESOURCE_VERSION" -> "EVENT_DATA"
          ~ type     = "NUMBER(38,0)" -> "VARIANT"
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 22 to add, 4 to change, 22 to destroy.

Warning: Argument is deprecated

  with module.event_sourcing.module.table.snowflake_table.this,
  on .terraform/modules/event_sourcing.table/snowflake/modules/table/main.tf line 21, in resource "snowflake_table" "this":
  21:   data_retention_days = 7

Use data_retention_time_in_days attribute instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: production.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "production.plan"
```
</details>